app/controllers/answers_controller.rb

  def create
    @answer = @question.answers.build(params[:answer])
    @answer.save
---
INSERT INTO "answers" ("question_id", "correct", "created_at", "body", "updated_at") VALUES(1, 'f', '2010-03-04 12:04:32.233239', E'asdfasf', '2010-03-04 12:04:32.233239') RETURNING "id"

  def find_question
    @question = @quiz.questions.find(params[:question_id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1 AND ("questions".quiz_id = 1))