app/controllers/dashboards_controller.rb

  def show
    @participating_quizzes = current_user.participating_quizzes_for_dashboard
    @your_quizzes = current_user.quizzes
    @questions_awaiting_approval = current_user.questions.awaiting_approval.all(
      :include => [:quiz, :suggester]
    )
---
SELECT * FROM "quizzes" WHERE ("quizzes".user_id = 1)