app/controllers/questions_controller.rb

SELECT * FROM "answers" WHERE ("answers".question_id = 1)
---
  def show
    @answer = Answer.new
    @answers = @question.answers
    @tags = @question.tags

    if participant?
      @user_answer = current_user.answers.find_or_initialize_by_question_id(@question)