app/controllers/questions_controller.rb

  def create
    @question = @quiz.questions.build(params[:question])
    if @question.save
---
INSERT INTO "questions" ("position", "created_at", "body", "updated_at", "answers_count", "quiz_id") VALUES(2, '2010-03-04 13:38:07.324544', E'What is the difference between `require` and `load`?', '2010-03-04 13:38:07.324544', 0, 1) RETURNING "id"

  def find_question
    @question = @quiz.questions.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 2 AND ("questions".quiz_id = 1)) ORDER BY questions.position ASC