app/controllers/quizzes_controller.rb

  def index
    @recently_added = Quiz.recently_added
    @categories = Category.all(:order => 'name ASC')
---
SELECT * FROM "categories" ORDER BY name ASC