app/controllers/users_controller.rb

INSERT INTO "users" ("name", "single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES(E'Justin Ko', E'Ca-bn04mjl9wrx_59inS', '2010-02-28 08:34:47.590381', '2010-02-28 08:34:47.591513', E'$2a$10$blxG4kXXjBD0uSUfZKul1.D6xUAOUXNtnnV/okq4XX/fhzDVrwQQy', E'2sKPlglKJTkcTGAUQgdU', '2010-02-28 08:34:47.591513', 0, E'127.0.0.1', E'lPAFvm58mQ6CXn9W7Ii5', '2010-02-28 08:34:47.406379', E'0576209b4458151a23c4d3df92a14d3a3f800241ca746ef617220fe138692114b6ae5b17554ab5f55ae61c4206cd2178934399d2c915ebd1bad347701e70e355', 1, NULL, NULL, E'test@test.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if verify_recaptcha(:model => @user) && @user.save